marvel_rivals_hero_api/app/controllers/api/v1/heroes_controller.rb

        def index
          heroes = Hero.includes(:role).all
          render json: heroes.map { |hero| serialize_hero(hero) }
---
SELECT "heros".* FROM "heros"
SELECT "roles".* FROM "roles" WHERE "roles"."id" IN (1, 2, 3)