marvel_rivals_hero_api/app/controllers/api/v1/roles_controller.rb

        def index
            roles = Role.all
---
SELECT "roles".* FROM "roles"